[
  {
    "ID #:":1,
    "Title":"18K White Gold Diamond Cluster Ring - 0.92ct + 10.4g Solid Gold",
    "Description":"This elegant statement ring is crafted from 10.4 grams of solid 18K white gold, giving it a substantial, high-end feel. The ring showcases a bold multi-row cluster design adorned with approximately 0.92 carats of natural round-cut diamonds, creating a radiant sparkle that catches light beautifully from every angle.\n\nPerfect for collectors, investors, or anyone seeking a timeless, eye-catching piece of fine jewelry.\n\n\n\nDetails:\n\nMetal: Solid 18K white gold (10.4 grams total weight)\n\nGemstones: Natural round-cut diamonds\n\nTotal Diamond Weight: Approx. 0.92 carats\n\nStyle: Multi-row cluster \/ statement ring\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\n\n\nThis ring combines the weight and luxury of solid 18K gold with the brilliance of nearly one carat of diamonds—a true statement of craftsmanship and elegance.",
    "Price":2500
  },
  {
    "ID #:":2,
    "Title":"14K Solid Gold Horse Brooch Pin – 8.56g with 0.20ct Diamonds, Equestrian Jewelry",
    "Description":"This beautifully crafted brooch features a graceful running horse atop a stylized arrow, symbolizing power and motion. The piece is made from solid 14K yellow gold, weighing a substantial 8.56 grams, and adorned with approximately 0.20 carats (20 points) of sparkling natural diamonds set into four hanging horseshoe charms for added movement and brilliance.\n\n\n\nA perfect collector’s piece or gift for horse lovers and equestrian enthusiasts, combining artistry with timeless elegance.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold (8.56 grams total weight)\n\nGemstones: Natural round-cut diamonds\n\nTotal Diamond Weight: Approx. 0.20 carats\n\nDesign: Running horse on arrow with dangling diamond-set horseshoes\n\nStyle: Vintage \/ Equestrian \/ Statement brooch\n\nCondition: Excellent pre-owned; cleaned and polished\n\n\n\nThis unique brooch embodies strength, motion, and luxury — a stunning addition to any fine jewelry or equestrian collection.",
    "Price":2100
  },
  {
    "ID #:":3,
    "Title":"14K Solid Gold “Krystal” Name Pendant 6.5g Script Custom Personalized Jewelry",
    "Description":"This beautifully handcrafted pendant features the name “Krystal” in elegant cursive script, accented with delicate heart motifs and fine detailing. Made from solid 14K yellow gold and weighing 6.5 grams, it’s a high-quality statement piece that blends personalization with luxury.\n\n\n\nDesigned to be worn on your favorite chain, this pendant adds a bold yet timeless touch to any jewelry collection.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold (6.5 grams total weight)\n\nDesign: Custom name pendant – “Krystal” in decorative script\n\nStyle: Personalized \/ Statement \/ Hip-hop \/ Nameplate\n\nDimensions: (Add if known; otherwise omit)\n\nCondition: Excellent pre-owned; cleaned and polished\n\nChain: Not included (pendant only)\n\n\n\nThis pendant offers a classic nameplate design with solid gold craftsmanship — ideal for anyone who loves custom jewelry with personality and shine.",
    "Price":1500
  },
  {
    "ID #:":4,
    "Title":"14K Solid Gold “Melissa” Name Pendant 2g Script Custom Personalized Jewelry",
    "Description":"This beautiful pendant features the name “Melissa” in an elegant cursive script, detailed with fine diamond-cut texturing for extra shine. Crafted from solid 14K yellow gold, this personalized piece weighs 5.8 grams, giving it a luxurious feel and high-quality presence.\n\nThe pendant’s smooth back and bold lettering make it a perfect everyday piece or a thoughtful custom gift.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold (2 grams total weight)\n\nDesign: Custom name pendant – “Melissa” in decorative script\n\nStyle: Personalized \/ Nameplate \/ Statement Jewelry\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\nChain: Not included (pendant only)\n\n\nThis pendant blends personalized craftsmanship with the luxury of solid gold, making it a timeless addition to any fine jewelry collection.",
    "Price":500
  },
  {
    "ID #:":5,
    "Title":"10K Solid Gold Masonic Brooch Pin 3.5g Vintage Freemason Jewelry w\/ Diamond",
    "Description":"This beautifully detailed Masonic pin is crafted from solid 10K yellow gold, weighing 3.5 grams. The circular filigree frame surrounds the classic Freemason emblem featuring colored enamel accents and a small diamond-shaped stone at the base, representing craftsmanship and fraternity.\n\nA fine collectible for Masons or vintage jewelry enthusiasts, this piece can be worn as a lapel pin or brooch and makes a meaningful gift or heirloom.\n\n\n\nDetails:\n\nMetal: Solid 10K yellow gold (3.5 grams total weight)\n\nDesign: Freemason \/ Masonic emblem with enamel detailing\n\nGemstone: Small diamond-shaped accent stone (likely cubic zirconia or diamond)\n\nStyle: Vintage fraternal pin \/ brooch\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\nDimensions: (Add size if known)\n\nClasp: Secure pin backing\n\n\n\nThis elegant piece combines heritage symbolism with fine gold craftsmanship, making it a timeless addition to any jewelry or Freemason collection.",
    "Price":750
  },
  {
    "ID #:":6,
    "Title":"14K Solid Gold Lady Pendant 3.61g with Ruby Sapphire & Pearl Vintage Jewelry",
    "Description":"This elegant vintage-style pendant depicts a lady in a gown, crafted in solid 14K yellow gold and adorned with rubies, sapphire, and cultured pearls. The intricate design features a textured star-patterned border and gemstone-accented dress, symbolizing grace and timeless beauty.\n\nA unique collectible or gift for fine jewelry lovers, this pendant captures both craftsmanship and character, making it a standout piece for any occasion.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold (3.61 grams total weight)\n\nGemstones: Ruby, sapphire, and cultured pearls\n\nDesign: Lady in dress within circular star motif\n\nStyle: Vintage \/ Figurative \/ Statement pendant\n\nCondition: Excellent pre-owned; cleaned and polished\n\nChain: Not included (pendant only)\n\n\n\nThis charming pendant combines artistic design and fine materials, creating a collectible treasure that reflects vintage elegance.",
    "Price":850
  },
  {
    "ID #:":7,
    "Title":"14K Solid Gold “Suzanne” Name Pendant 6.33g w\/ 0.20ct Diamonds Custom Jewelry",
    "Description":"This luxurious “Suzanne” pendant is crafted from solid 14K yellow gold and set with approximately 0.20 carats (20 points) of round-cut diamonds, adding elegant sparkle across the script lettering.\nThe name is rendered in a bold, flowing cursive design, detailed with diamond-cut edging that enhances brilliance from every angle.\n\nA timeless personalized piece — perfect as a gift or a fine addition to your jewelry collection.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold (6.33 grams total weight)\n\nGemstones: Natural diamonds ≈ 0.20 ct total weight\n\nDesign: Custom name pendant – “Suzanne” script with diamond accents\n\nStyle: Personalized \/ Nameplate \/ Diamond Jewelry\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\nChain: Not included (pendant only)\n\n\n\nThis solid gold diamond name pendant showcases exceptional craftsmanship and personalized luxury — a radiant keepsake designed to shine for years to come.",
    "Price":1600
  },
  {
    "ID #:":9,
    "Title":"18K Solid Gold “Patricia” Name Pendant 3.9g with Diamond Heart Accent",
    "Description":"This elegant name pendant spells “Patricia” in a smooth cursive script and features a sparkling diamond heart accent beneath the name. Crafted from solid 18K yellow gold, it weighs 3.9 grams, combining classic luxury with personalized charm.\n\nPerfect for everyday wear or gifting, this piece adds a touch of individuality to any fine jewelry collection.\n\n\n\nDetails:\n\nMetal: Solid 18K yellow gold (3.9 grams total weight)\n\nGemstone: Diamond (heart-shaped accent, natural; size not specified)\n\nDesign: Custom name pendant – “Patricia” with heart detail\n\nStyle: Personalized \/ Diamond Accent \/ Nameplate pendant\n\nCondition: Excellent pre-owned; cleaned and polished\n\nChain: Not included (pendant only)\n\n\n\nThis pendant combines personalized design with fine diamond detailing, creating a timeless keepsake that radiates elegance and craftsmanship.",
    "Price":1400
  },
  {
    "ID #:":10,
    "Title":"10K Solid Gold Pendant 1.5g Smoky Topaz with Diamond Accent Elegant Jewelry",
    "Description":"This elegant teardrop pendant features a smoky topaz gemstone accented by sparkling natural diamonds along a graceful 10K yellow gold setting. The warm brown tones of the topaz create a sophisticated contrast with the radiant gold and diamond highlights.\n\nPerfect for everyday wear or formal occasions, this pendant captures timeless elegance in a compact, wearable size.\n\n\n\nDetails:\n\nMetal: Solid 10K yellow gold (1.5 grams total weight)\n\nGemstones: Smoky topaz (pear-shaped) and natural diamonds\n\nDesign: Teardrop motif with diamond-accented gold curve\n\nStyle: Fine gemstone pendant \/ Elegant everyday jewelry\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\nChain: Not included (pendant only)\n\n\n\nThis smoky topaz and diamond pendant blends warmth and brilliance, making it a versatile and classic addition to any fine jewelry collection.",
    "Price":400
  },
  {
    "ID #:":11,
    "Title":"14K Solid Gold Poodle Brooch 13.1g Ruby & Sapphire Eyes Vintage Dog Pin",
    "Description":"This exquisite 14K yellow gold poodle brooch captures lifelike texture and charm, featuring finely detailed fur and gemstone accents. The brooch showcases ruby and sapphire eyes and a richly polished finish, combining elegance with playful sophistication.\n\nWeighing 13.1 grams, this piece has a beautiful weight and presence, making it both a collectible vintage accessory and a statement of craftsmanship.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold (13.1 grams total weight)\n\nGemstones: Ruby and sapphire (set as eyes and collar accents)\n\nDesign: Textured gold poodle with gemstone details\n\nStyle: Vintage brooch \/ animal collectible pin\n\nCondition: Excellent pre-owned; clasp secure, professionally cleaned\n\nMarkings: Tested 14K gold\n\n\n\nThis luxury 14K gold poodle brooch is a standout conversation piece — blending elegance, artistry, and charm in one timeless design.",
    "Price":2800
  },
  {
    "ID #:":12,
    "Title":"14K White Gold Turquoise Bead Bracelet Elegant Natural Gemstone Jewelry",
    "Description":"This refined bracelet features beautifully polished natural turquoise beads accented by a solid 14K white gold filigree clasp. The vibrant turquoise stones display natural veining and rich color, creating a timeless and versatile piece that complements both casual and formal wear.\n\nThe bracelet’s design combines handcrafted beadwork with fine gold detailing, resulting in a piece that exudes understated luxury and artistry.\n\n\n\nDetails:\n\nMetal: Solid 14K white gold clasp\n\nGemstone: Natural turquoise beads (round, polished finish)\n\nClasp Type: Filigree box clasp with secure closure\n\nLength: Approx. standard wrist fit (7–7.5 inches)\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\nStyle: Fine gemstone bracelet \/ classic turquoise strand\n\n\n\nA stunning handcrafted turquoise bracelet with fine 14K gold detailing — perfect as a thoughtful gift or timeless addition to your jewelry collection.",
    "Price":500
  },
  {
    "ID #:":13,
    "Title":"14K Solid Gold U.S. Military Eagle Insignia Pendant 16.64g Patriotic Jewelry",
    "Description":"This striking pendant features the Great Seal of the United States, beautifully crafted in solid 14K yellow gold. The detailed design showcases the iconic eagle clutching arrows and an olive branch, symbolizing strength and peace — a timeless emblem of American pride and craftsmanship.\n\nWeighing 16.64 grams, this pendant has a substantial feel and brilliant polish, making it a perfect statement piece for collectors, veterans, or anyone wishing to wear a symbol of honor and heritage.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold\n\nWeight: 16.64 grams\n\nDesign: U.S. Military Eagle \/ Great Seal insignia\n\nStyle: Pendant (bail fits most standard chains)\n\nFinish: High-polish with detailed engraving\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\n\n\nA commanding and beautifully made solid gold insignia pendant that stands out with craftsmanship, symbolism, and luxury appeal.",
    "Price":3000
  },
  {
    "ID #:":14,
    "Title":"14K Solid Gold Harley-Davidson Logo Pendant 15.7g Motorcycle Jewelry",
    "Description":"Celebrate American craftsmanship and freedom of the open road with this authentic Harley-Davidson logo pendant, beautifully cast in solid 14K yellow gold. The piece features the iconic “Motor Harley-Davidson Cycles” emblem with crisp engraving and a high-polish finish, capturing the rugged elegance of the brand.\n\nWeighing 15.7 grams, this pendant is substantial in weight and presence — ideal for Harley riders, collectors, or anyone with a love for classic Americana.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold\n\nWeight: 15.7 grams\n\nDesign: Harley-Davidson shield logo\n\nFinish: Polished and engraved\n\nStyle: Pendant (fits most standard chains)\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\n\n\nA timeless piece of Harley-Davidson heritage in solid gold, blending luxury with the spirit of the open road.",
    "Price":2600
  },
  {
    "ID #:":15,
    "Title":"14K Gold Heart Pendant with Pearl 1.8g Elegant Fine Jewelry",
    "Description":"This charming pendant features a lustrous white pearl nestled within a solid 14K yellow gold heart, symbolizing timeless love and sophistication. The soft glow of the pearl contrasts beautifully against the warm gold, creating a delicate and feminine piece that can be worn daily or reserved for special occasions.\n\nLightweight yet crafted with precision, this pendant embodies understated luxury and makes for a thoughtful gift or a meaningful addition to any fine jewelry collection.\n\n\n\nDetails:\n\nMetal: Solid 14K yellow gold\n\nWeight: 1.8 grams\n\nGemstone: White pearl (round)\n\nDesign: Open heart with centered pearl\n\nStyle: Pendant (fits most chains)\n\nCondition: Excellent pre-owned; professionally cleaned and polished\n\n\n\nA timeless gold heart pendant with a luminous pearl, perfect for celebrating elegance, love, and enduring style.",
    "Price":450
  },
  {
    "ID #:":16,
    "Title":"Jade Buddha Pendant with 14K Gold Loop",
    "Description":"Jade Buddha Pendant with 14K Gold Loop.",
    "Price":360
  }
]